modules/budget/sync/ui/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":api:actual" [fillcolor="#160185"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:encryption" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":budget:sync:ui" [fillcolor="#6b6b01"]
  ":budget:sync:vm" [fillcolor="#914141"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":core:ui" [fillcolor="#6b6b01"]
  ":l10n" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":api:actual" -> ":budget:model" [style="bold"]
  ":api:actual" -> ":codegen:annotation" [style="dashed"]
  ":api:actual" -> ":core:model" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":budget:encryption" -> ":budget:model" [style="bold"]
  ":budget:encryption" -> ":core:model" [style="bold"]
  ":budget:sync:ui" -> ":budget:sync:vm" [style="bold"]
  ":budget:sync:ui" -> ":core:model" [style="dashed"]
  ":budget:sync:ui" -> ":core:ui" [style="bold"]
  ":budget:sync:ui" -> ":l10n" [style="dashed"]
  ":budget:sync:vm" -> ":api:actual" [style="dashed"]
  ":budget:sync:vm" -> ":budget:encryption" [style="bold"]
  ":budget:sync:vm" -> ":budget:model" [style="bold"]
  ":budget:sync:vm" -> ":core:di" [style="bold"]
  ":budget:sync:vm" -> ":core:model" [style="dashed"]
  ":budget:sync:vm" -> ":logging" [style="dashed"]
  ":budget:sync:vm" -> ":prefs" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":budget:model" [style="bold"]
  ":core:ui" -> ":core:di" [style="dashed"]
  ":core:ui" -> ":core:model" [style="bold"]
  ":core:ui" -> ":l10n" [style="dashed"]
  ":prefs" -> ":core:model" [style="bold"]
}
